#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриСозданииЧтенииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КаналПриИзменении(Элемент)
	КаналПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	УстановитьОрганичениеТиповНастройки();
	УстановитьВидимостьЭлементовНаСервере();
КонецПроцедуры

&НаСервере
Процедура КаналПриИзмененииНаСервере()
	УстановитьОрганичениеТиповНастройки();
	УстановитьВидимостьЭлементовНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьОрганичениеТиповНастройки()
	Если Объект.Канал=Перечисления.КаналыОповещений.Email Тогда
		ОписаниеТипов=Новый ОписаниеТипов("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты");
	ИначеЕсли Объект.Канал=Перечисления.КаналыОповещений.RocketChat Тогда
		ОписаниеТипов=Новый ОписаниеТипов("СправочникСсылка.УчетныеЗаписиRocketChat");
	Иначе
		ОписаниеТипов=Новый ОписаниеТипов;
	КонецЕсли;
	Элементы.Настройка.ОграничениеТипа=ОписаниеТипов;
КонецПроцедуры

// Установить видимость элементов на сервере.
&НаСервере
Процедура УстановитьВидимостьЭлементовНаСервере()
	ЭтоСистемаВзаимодействий = Объект.Канал = Перечисления.КаналыОповещений.СистемаВзаимодействия;
	Элементы.Настройка.Видимость = Не ЭтоСистемаВзаимодействий;
	Элементы.ИмяПользователяСистемыВзаимодействий.Видимость = ЭтоСистемаВзаимодействий;
КонецПроцедуры

#КонецОбласти

