Функция ЗаписатьПрисоединенныйФайлВБазу(ПараметрыФайла,АдресФайлаВоВременномХранилище,Форма, ПутьКДанным,Предмет=Неопределено) Экспорт
	ПрисоединенныйФайл=РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресФайлаВоВременномХранилище);
	
	Если Не Предмет=Неопределено Тогда
		УправлениеЗадачами.УстановитьПредметПрисоединенногоФайла(ПрисоединенныйФайл,Предмет);
	КонецЕсли;
	
	Возврат ПрисоединенныйФайл;
КонецФункции

Процедура ЗаполнитьПрисоединенныеФайлыКОбъекту(ПрисоединенныеФайлы, ВладелецФайлов,Форма, ПутьКДанным) Экспорт
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ВладелецФайлов, ПрисоединенныеФайлы);
КонецПроцедуры

Процедура ПриПолученииДанныхФайла(ДанныеФайла, ПрисоединенныйФайл, ИдентификаторФормы,Форма, ВладелецФайлов, ПутьКДанным)  Экспорт
	ДополнительныеПараметры = Новый Структура("ИдентификаторФормы", ИдентификаторФормы);

	ДанныеФайла = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл, ДополнительныеПараметры);
КонецПроцедуры

