Процедура ЗаписатьПрисоединенныйФайлВБазу(ПараметрыФайла,АдресФайлаВоВременномХранилище,Форма, ПутьКДанным,Предмет=Неопределено) Экспорт
	УправлениеЗадачами.ЗаписатьПрисоединенныйФайлВБазу(ПараметрыФайла, АдресФайлаВоВременномХранилище, Предмет);
КонецПроцедуры

Процедура ЗаполнитьПрисоединенныеФайлыКОбъекту(ПрисоединенныеФайлы, ВладелецФайлов,Форма, ПутьКДанным) Экспорт
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ВладелецФайлов, ПрисоединенныеФайлы);
КонецПроцедуры

Процедура ПриПолученииДанныхФайла(ДанныеФайла, ПрисоединенныйФайл, ИдентификаторФормы,Форма, ВладелецФайлов, ПутьКДанным)  Экспорт
	ДополнительныеПараметры = Новый Структура("ИдентификаторФормы", ИдентификаторФормы);

	ДанныеФайла = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл, ДополнительныеПараметры);
КонецПроцедуры

