Процедура ЗаполнитьАвтораВРегистреТрудозатраты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Трудозатраты.Регистратор КАК Регистратор,
	|	Трудозатраты.Регистратор.Автор КАК РегистраторАвтор
	|ИЗ
	|	РегистрНакопления.Трудозатраты КАК Трудозатраты
	|ГДЕ
	|	Трудозатраты.Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И Трудозатраты.Активность
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрНакопления.Трудозатраты";
	
	ВыборкаРегистратор = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРегистратор.Следующий() Цикл
		
		Набор = РегистрыНакопления.Трудозатраты.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		Набор.Прочитать();
		
		Для Каждого Запись Из Набор Цикл
			Запись.Автор = ВыборкаРегистратор.РегистраторАвтор;
		КонецЦикла;
		
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры



Процедура ПроверитьВозможностьРедактированияЗадачиПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	УправлениеЗадачами.ПроверитьВозможностьРедактированияЗадачиПередЗаписью(Источник, Отказ);
КонецПроцедуры

Процедура ПроверитьВозможностьРедактированияЗадачиПередЗаписьюСправочникаПередЗаписью(Источник, Отказ) Экспорт
	УправлениеЗадачами.ПроверитьВозможностьРедактированияЗадачиПередЗаписью(Источник, Отказ);
КонецПроцедуры

