Процедура ПоискПроектовПоПодстрокеНаименования(СтрокаПоиска,РезультатПоиска,ДополнительныеПараметры) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Проекты.Наименование КАК Наименование,
	|	Проекты.Ссылка КАК Ссылка,
	|	Проекты.Партнер КАК Партнер
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	Проекты.Наименование ПОДОБНО &Наименование";
	Запрос.УстановитьПараметр("Наименование","%"+СтрокаПоиска+"%");
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РезультатПоиска.Добавить(Выборка.Ссылка,Выборка.Наименование,БиблиотекаКартинок.Redmine,"ПоискПроектовПоПодстрокеНаименования");
	КонецЦикла;
КонецПроцедуры

Процедура ПоискЗадачиПоНомеру(СтрокаПоиска,РезультатПоиска,ДополнительныеПараметры) Экспорт
	Попытка
		Номер=Число(СтрокаПоиска);
	Исключение
		Номер=Неопределено;
	КонецПопытки;
	            
	Если Номер<>Неопределено Тогда 
		Задача=УправлениеЗадачами.НайтиЗадачуПоНомеру(Номер);
		Если ЗначениеЗаполнено(Задача) Тогда
			РезультатПоиска.Добавить(Задача,Строка(Задача),БиблиотекаКартинок.Задача,"ПоискЗадачиПоНомеру");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьРезультатПоискПолнотекстовый(СтрокаПоиска,РезультатПоиска,ДополнительныеПараметры) Экспорт
	РезультатПоиска.Добавить("ПолнотекстовыйПоиск","Полнотекстовый поиск",БиблиотекаКартинок.Задача,"ДобавитьРезультатПоискПолнотекстовый", СтрокаПоиска);
КонецПроцедуры

