Процедура ПоискПроектовПоПодстрокеНаименования(СтрокаПоиска,РезультатПоиска,ДополнительныеПараметры) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Проекты.Наименование КАК Наименование,
	|	Проекты.Ссылка КАК Ссылка,
	|	Проекты.Партнер КАК Партнер
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	Проекты.Наименование ПОДОБНО &Наименование";
	Запрос.УстановитьПараметр("Наименование","%"+СтрокаПоиска+"%");
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РезультатПоиска.Добавить(Выборка.Ссылка,Выборка.Наименование,БиблиотекаКартинок.Redmine,"ПоискПроектовПоПодстрокеНаименования");
	КонецЦикла;
КонецПроцедуры
