////////////////////////////////////////////////////////////////////////////////
// Работа с таймерами учета трудозатрат
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Процедура ВставитьКнопкуУправленияТаймеромНаФорму(Форма,Родитель) Экспорт
	
	//Элементы = Форма.Элементы;
	//ИмяКоманды = Метаданные.ОбщиеКоманды.ОбработатьНажатиеКнопкиТаймера.Имя;
	//
	//Если Элементы.Найти(ИмяКоманды) = Неопределено Тогда
	//	Кнопка = Элементы.Вставить(ИмяКоманды, Тип("КнопкаФормы"), Родитель);
	//	Кнопка.Заголовок = "";
	//	Кнопка.ИмяКоманды = "ОбщаяКоманда."+ИмяКоманды;
	//КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти