#Область ПрограммныйИнтерфейс

// Добавляет признак изменения пометки удаления документа.
// Состав параметров процедуры соответствует подписке на событие ПередЗаписью объекта Документ.
// Описание см. в синтакс-помощнике.
//
// Параметры:
//  Источник        - ДокументОбъект           - источник события подписки.
//  Отказ           - Булево                   - признак отказа от записи. Если установить Истина, то запись выполнена не
//                                               будет, и будет вызвано исключение.
//  РежимЗаписи     - РежимЗаписиДокумента     - текущий режим записи документа-источника.
//  РежимПроведения - РежимПроведенияДокумента - текущий режим проведения документа-источника.
//
Процедура УстановитьСтатусИзмененияПометкиУдаленияДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ЗаметкиПользователяСлужебный.УстановитьСтатусИзмененияПометкиУдаления(Источник);
КонецПроцедуры

// Добавляет признак изменения пометки удаления объекта.
// Состав параметров процедуры соответствует подписке на событие ПередЗаписью объектов кроме Документ.
// Описание см. в синтакс-помощнике.
//
// Параметры:
//  Источник - Объект - источник события подписки.
//  Отказ    - Булево - признак отказа от записи. Если установить Истина, то запись выполнена не
//                      будет, и будет вызвано исключение.
//
Процедура УстановитьСтатусИзмененияПометкиУдаленияОбъекта(Источник, Отказ) Экспорт
	ЗаметкиПользователяСлужебный.УстановитьСтатусИзмененияПометкиУдаления(Источник);
КонецПроцедуры

#КонецОбласти
