#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ТрудозатратыПоПроектам");
	НастройкиВарианта.Описание = НСтр("ru = 'Трудозатраты по проектам.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ТрудозатратыПоПользователям");
	НастройкиВарианта.Описание = НСтр("ru = 'Трудозатраты по пользователям.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДинамикаОтбивок");
	НастройкиВарианта.Описание = НСтр("ru = 'Динамика общих отбивок по периодам.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ТрудозатратыПоПредмету");
	НастройкиВарианта.Описание = НСтр("ru = 'Трудозатраты по предмету.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	НастройкиВарианта.Включен = Ложь;
	
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли