
////////////////////////////////////////////////////////////////////////////////
// УчетВремениВызовСервера
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ТекущиеТаймерыПользователя(Пользователь = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Возврат УчетВремени.ТекущиеТаймерыПользователя(Пользователь,ДополнительныеПараметры);	
КонецФункции

Функция ЗафиксироватьОкончаниеРаботПоТекущимТаймерам(ТекущиеТаймеры, ПараметрыУчетаВремени) Экспорт
	Возврат УчетВремени.ЗафиксироватьОкончаниеРаботПоТекущимТаймерам(ТекущиеТаймеры, ПараметрыУчетаВремени);	
КонецФункции

Функция ОтразитьИзменениеТаймераУчетаВремени(Идентификатор, ПараметрыУчетаВремени) Экспорт
	Возврат УчетВремени.ОтразитьИзменениеТаймераУчетаВремени(Идентификатор, ПараметрыУчетаВремени);	
КонецФункции

Функция УдалитьТаймер(Идентификатор) Экспорт
	Возврат УчетВремени.УдалитьТаймер(Идентификатор);	
КонецФункции

Функция ВедетсяУчетВремени() Экспорт
	Возврат УчетВремени.ВедетсяУчетВремени();	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
