
////////////////////////////////////////////////////////////////////////////////
// УчетВремениВызовСервера
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ТекущиеТаймерыПользователя(Пользователь = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Возврат УчетВремени.ТекущиеТаймерыПользователя(Пользователь,ДополнительныеПараметры);	
КонецФункции

Функция ЗафиксироватьОкончаниеРаботПоТекущимТаймерам(ТекущиеТаймеры, ПараметрыУчетаВремени) Экспорт
	Возврат УчетВремени.ЗафиксироватьОкончаниеРаботПоТекущимТаймерам(ТекущиеТаймеры, ПараметрыУчетаВремени);	
КонецФункции

Функция ОтразитьИзменениеТаймераУчетаВремени(Идентификатор, ПараметрыУчетаВремени) Экспорт
	Возврат УчетВремени.ОтразитьИзменениеТаймераУчетаВремени(Идентификатор, ПараметрыУчетаВремени);	
КонецФункции

Процедура УдалитьТаймер(Идентификатор) Экспорт
	УчетВремени.УдалитьТаймер(Идентификатор);	
КонецПроцедуры

Функция ВедетсяУчетВремени() Экспорт
	Возврат УчетВремени.ВедетсяУчетВремени();	
КонецФункции

Функция ДанныеТаймера(Идентификатор) Экспорт
	Возврат УчетВремени.ДанныеТаймера(Идентификатор);
КонецФункции

Функция СоздатьИСтартоватьТаймер(Предмет) Экспорт
	Возврат УчетВремени.СоздатьИСтартоватьТаймер(Предмет);
КонецФункции

Процедура СтартоватьТаймер(Идентификатор) Экспорт
	УчетВремени.СтартоватьТаймер(Идентификатор);
КонецПроцедуры

Функция СоздатьТаймер(Предмет) Экспорт
	Возврат УчетВремени.СоздатьТаймер(Предмет);
КонецФункции

Процедура ОстановитьТаймер(Идентификатор) Экспорт
	УчетВремени.ОстановитьТаймер(Идентификатор);
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
