
Процедура ОбработкаПроведения(Отказ, Режим)

	Если Статус=Перечисления.СтатусыФормированияЗаказа.Формируется Тогда
		Возврат;
	КонецЕсли;
	
	// регистр ВысталенныеЗадачи 
	Движения.ВысталенныеЗадачи.Записывать = Истина;
	Для Каждого ТекСтрокаЗадачи Из Задачи Цикл
		Движение = Движения.ВысталенныеЗадачи.Добавить();
		Движение.Период = Дата;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.Партнер = Партнер;
		Движение.Задача = ТекСтрокаЗадачи.Задача;
		Движение.Исполнитель = ТекСтрокаЗадачи.Исполнитель;
		Движение.КоличествоЧасов = ТекСтрокаЗадачи.КоличествоЧасов;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный=ПользователиКлиентСервер.ТекущийПользователь();
	ПериодРегистрации=НачалоМесяца(ТекущаяДата());
	Статус=Перечисления.СтатусыФормированияЗаказа.Формируется;
КонецПроцедуры
