Функция ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным,ФорматТекста) Экспорт
	#Если Клиент Тогда
		ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	#Иначе
		ВариантыФорматаТекста=РедакторКомментария.ВариантыОформленияТекстаКомментария();
	#КонецЕсли
	Если ФорматТекста=ВариантыФорматаТекста.Markdown Тогда
		Возврат РМ_MarkdownКлиентСервер.ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
	Иначе
		Возврат РВ_РедакторWysiwygHTMLКлиентСервер.ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
	КонецЕсли;	

КонецФункции

Функция ИмяТаблицыПрисоединенныхФайлов(ПутьКДаннымБезЛишнего,ФорматТекста) Экспорт
	#Если Клиент Тогда
		ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	#Иначе
		ВариантыФорматаТекста=РедакторКомментария.ВариантыОформленияТекстаКомментария();
	#КонецЕсли
	Если ФорматТекста=ВариантыФорматаТекста.Markdown Тогда
		Возврат РМ_MarkdownКлиентСервер.ИмяТаблицыПрисоединенныхФайлов(ПутьКДаннымБезЛишнего);
	Иначе
		Возврат РВ_РедакторWysiwygHTMLКлиентСервер.ИмяТаблицыПрисоединенныхФайлов(ПутьКДаннымБезЛишнего);
	КонецЕсли;	
КонецФункции

Процедура  СконвертироватьИменаПрисоединенныхФайловВТексте(ДанныеПрисоединенныхФайлов, Текст, ФорматТекста) Экспорт
	#Если Клиент Тогда
		ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	#Иначе
		ВариантыФорматаТекста=РедакторКомментария.ВариантыОформленияТекстаКомментария();
	#КонецЕсли
	Если ФорматТекста=ВариантыФорматаТекста.Markdown Тогда
		РМ_MarkdownКлиентСервер.СконвертироватьИменаПрисоединенныхФайловВТексте(ДанныеПрисоединенныхФайлов, Текст);
	Иначе
		РВ_РедакторWysiwygHTMLКлиентСервер.СконвертироватьИменаПрисоединенныхФайловВТексте(ДанныеПрисоединенныхФайлов, Текст);
	КонецЕсли;	
КонецПроцедуры

Функция ДанныеПрисоединенныхФайлов(Форма, ПутьКДанным, ФорматТекста) Экспорт
	#Если Клиент Тогда
		ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	#Иначе
		ВариантыФорматаТекста=РедакторКомментария.ВариантыОформленияТекстаКомментария();
	#КонецЕсли
	Если ФорматТекста=ВариантыФорматаТекста.Markdown Тогда
		ПутьКДаннымБезЛишнего= РМ_MarkdownКлиентСервер.ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
		Возврат РМ_MarkdownКлиентСервер.ДанныеПрисоединенныхФайлов(Форма, ПутьКДаннымБезЛишнего);
	Иначе
		ПутьКДаннымБезЛишнего= РВ_РедакторWysiwygHTMLКлиентСервер.ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
		Возврат РВ_РедакторWysiwygHTMLКлиентСервер.ДанныеПрисоединенныхФайлов(Форма, ПутьКДаннымБезЛишнего);
	КонецЕсли;	
КонецФункции