Функция ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным,ФорматТекста) Экспорт
	#Если Клиент Тогда
		ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	#Иначе
		ВариантыФорматаТекста=РедакторКомментария.ВариантыОформленияТекстаКомментария();
	#КонецЕсли
	Если ФорматТекста=ВариантыФорматаТекста.Markdown Тогда
		Возврат РМ_MarkdownКлиентСервер.ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
	Иначе
		Возврат РВ_РедакторWysiwygHTMLКлиентСервер.ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
	КонецЕсли;	

КонецФункции

Функция ИмяТаблицыПрисоединенныхФайлов(ПутьКДаннымБезЛишнего,ФорматТекста) Экспорт
	#Если Клиент Тогда
		ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	#Иначе
		ВариантыФорматаТекста=РедакторКомментария.ВариантыОформленияТекстаКомментария();
	#КонецЕсли
	Если ФорматТекста=ВариантыФорматаТекста.Markdown Тогда
		Возврат РМ_MarkdownКлиентСервер.ИмяТаблицыПрисоединенныхФайлов(ПутьКДаннымБезЛишнего);
	Иначе
		Возврат РВ_РедакторWysiwygHTMLКлиентСервер.ИмяТаблицыПрисоединенныхФайлов(ПутьКДаннымБезЛишнего);
	КонецЕсли;	
КонецФункции