
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Обучение 
	Движения.Обучение.Записывать = Истина;
	Для Каждого ТекСтрокаПлан Из План Цикл
		Движение = Движения.Обучение.Добавить();
		Движение.Период = Дата;
		Движение.Пользователь = Пользователь;
		Движение.Курс = Курс;
		Движение.Урок = ТекСтрокаПлан.Урок;
		Движение.Дата = ТекСтрокаПлан.Дата;
		Движение.План = ТекСтрокаПлан.Длительность;
		Движение.Факт = 0;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Преподаватель = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Завершен = Ложь;
	
	Для Каждого Стр Из План Цикл
		Стр.Задача = Неопределено;
	КонецЦикла;
	
КонецПроцедуры
