#Область СохранениеКлиентовВоВременныеКаталоги

Функция ПолучитьИмяВременногоФайлаСохраненияКлиентаTigthtVNC() Экспорт 
	Если ОбщегоНазначенияКлиентСервер.ЭтоWindowsКлиент() Тогда
		ИмяФайла="TigthtVNC.exe";
	Иначе
		ИмяФайла="TigthtVNC.jar";
	КонецЕсли;
	
	ИмяВременногоФайла=ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(КаталогВременныхФайлов(),ИмяФайла);
	
	Возврат ИмяВременногоФайла;
КонецФункции

Процедура СохранитьКлиентTigthtVNCВоВременыйКаталогПользователя()
	Если ОбщегоНазначенияКлиентСервер.ЭтоWindowsКлиент() Тогда
		ИмяМакета="TigthtVNCx64";
	Иначе
		ИмяМакета="TightVNCJava";
	КонецЕсли;
	
	ИмяВременногоФайла=ПолучитьИмяВременногоФайлаСохраненияКлиентаTigthtVNC();
	
	Файл=Новый Файл(ИмяВременногоФайла);
	Если Не Файл.Существует() Тогда
		ДанныеМакета=ЦПР_ПодключенияСервер.ПолучитьДанныеОбщегоМакета(ИмяМакета);
		ДанныеМакета.Записать(ИмяВременногоФайла);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьИмяВременногоФайлаСохраненияКлиентаPutty() Экспорт 
	ИмяФайла="Putty.exe";
	
	ИмяВременногоФайла=ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(КаталогВременныхФайлов(),ИмяФайла);
	
	Возврат ИмяВременногоФайла;
КонецФункции

Процедура СохранитьКлиентPuttyВоВременыйКаталогПользователя()
	
	СистемнаяИнформация=Новый СистемнаяИнформация;
	
	Если СистемнаяИнформация.ТипПлатформы=ТипПлатформы.Windows_x86 Тогда
		ИмяМакета="Putty_x32";
	Иначе
		ИмяМакета="Putty_x64";
	КонецЕсли;
	
	ИмяВременногоФайла=ПолучитьИмяВременногоФайлаСохраненияКлиентаPutty();
	
	Файл=Новый Файл(ИмяВременногоФайла);
	Если Не Файл.Существует() Тогда
		ДанныеМакета=ЦПР_ПодключенияСервер.ПолучитьДанныеОбщегоМакета(ИмяМакета);
		ДанныеМакета.Записать(ИмяВременногоФайла);
	КонецЕсли;
КонецПроцедуры

Процедура СохранитьКлиентыПодключенийВПрограммВоВременныйКаталогПользователя()
	СохранитьКлиентTigthtVNCВоВременыйКаталогПользователя();	
	СохранитьКлиентPuttyВоВременыйКаталогПользователя();
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриНачалеРаботыСистемы() Экспорт 
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные) Экспорт
КонецПроцедуры

#КонецОбласти