///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))
	|	И ЧтениеСпискаРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))
	|	ИЛИ
	|	ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Контрагенты).Партнер)
	|	И ЧтениеСпискаРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Контрагенты).Партнер)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))
	|	И ИзменениеСпискаРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))
	|	ИЛИ
	|	ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Контрагенты).Партнер)
	|	И ИзменениеСпискаРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Контрагенты).Партнер)";
	
	Ограничение.ТекстДляВнешнихПользователей =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК БанковскиеСчета
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|	ПО Контрагенты.Ссылка = БанковскиеСчета.Владелец
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиПартнеры
	|	ПО ВнешниеПользователиПартнеры.ОбъектАвторизации = Контрагенты.Партнер
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ДемоКонтактныеЛицаПартнеров КАК _ДемоКонтактныеЛицаПартнеров
	|	ПО _ДемоКонтактныеЛицаПартнеров.Владелец = Контрагенты.Партнер
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиКонтактныеЛица
	|	ПО ВнешниеПользователиКонтактныеЛица.ОбъектАвторизации = _ДемоКонтактныеЛицаПартнеров.Ссылка
	|;
	|РазрешитьЧтение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец ТОЛЬКО Справочник.Организации)
	|	И ЧтениеСпискаРазрешено(Владелец ТОЛЬКО Справочник.Организации)
	|	ИЛИ
	|	ЗначениеРазрешено(ВнешниеПользователиПартнеры.Ссылка)
	|	И ЧтениеСпискаРазрешено(ВнешниеПользователиПартнеры.ОбъектАвторизации)
	|	ИЛИ
	|	ЗначениеРазрешено(ВнешниеПользователиКонтактныеЛица.Ссылка)
	|	И ЧтениеСпискаРазрешено(ВнешниеПользователиКонтактныеЛица.ОбъектАвторизации)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец ТОЛЬКО Справочник.Организации)
	|	И ИзменениеСпискаРазрешено(Владелец ТОЛЬКО Справочник.Организации)
	|	ИЛИ
	|	ЗначениеРазрешено(ВнешниеПользователиПартнеры.Ссылка)
	|	И ИзменениеСпискаРазрешено(ВнешниеПользователиПартнеры.ОбъектАвторизации)
	|	ИЛИ
	|	ЗначениеРазрешено(ВнешниеПользователиКонтактныеЛица.Ссылка)
	|	И ИзменениеСпискаРазрешено(ВнешниеПользователиКонтактныеЛица.ОбъектАвторизации)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
