#Область ПрограммныйИнтерфейс

Процедура ПередЗаписью(Форма, ПутьКДанным, ФорматТекста=Неопределено) Экспорт
	ФорматТекстаРедактирования=РедакторКомментария.ФорматТекстаРедактирования(ФорматТекста);
	ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	
	Если ФорматТекстаРедактирования=ВариантыФорматаТекста.HTML Тогда
		РВ_РедакторWysiwygHTMLКлиент.УстановитьЗначениеПоляРедактированияВРеквизит(Форма,ПутьКДанным)
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным,ФорматТекста) Экспорт
	ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	Если ФорматТекста=ВариантыФорматаТекста.Markdown Тогда
		Возврат РМ_MarkdownКлиентСервер.ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
	Иначе
		Возврат РВ_РедакторWysiwygHTMLКлиентСервер.ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
	КонецЕсли;	

КонецФункции

Функция ДанныеПрисоединенныхФайлов(Форма,ПутьКДаннымБезЛишнего, ФорматТекста) Экспорт
	ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	Если ФорматТекста=ВариантыФорматаТекста.Markdown Тогда
		Возврат РМ_MarkdownКлиентСервер.ДанныеПрисоединенныхФайлов(Форма,ПутьКДаннымБезЛишнего);
	Иначе
		Возврат РВ_РедакторWysiwygHTMLКлиентСервер.ДанныеПрисоединенныхФайлов(Форма,ПутьКДаннымБезЛишнего);
	КонецЕсли;	
	
КонецФункции

#КонецОбласти