#Область ПрограммныйИнтерфейс

Процедура ПередЗаписью(Форма, ПутьКДанным, ФорматТекста=Неопределено) Экспорт
	ФорматТекстаРедактирования=РедакторКомментария.ФорматТекстаРедактирования(ФорматТекста);
	ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	
	Если ФорматТекстаРедактирования=ВариантыФорматаТекста.HTML Тогда
		РВ_РедакторWysiwygHTMLКлиент.УстановитьЗначениеПоляРедактированияВРеквизит(Форма,ПутьКДанным);
	Иначе
		РМ_MarkdownКлиент.ПередЗаписью(Форма, ПутьКДанным);
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗакрытии(Форма, ПутьКДанным, ФорматТекста=Неопределено) Экспорт
//	ФорматТекстаРедактирования=РедакторКомментария.ФорматТекстаРедактирования(ФорматТекста);
	ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	
	Если ФорматТекста = ВариантыФорматаТекста.HTML Тогда
		ЭлементПросмотраКомментария=Форма.Элементы[РВ_РедакторWysiwygHTMLКлиентСервер.ПолучитьИмяЭлементаРедактированияКомментария(
			ПутьКДанным)];
		Документ=ЭлементПросмотраКомментария.Документ;
		Документ.body.innerHtml="";	
//			
//		ИмяЭлемента=РВ_РедакторWysiwygHTMLКлиентСервер.ПолучитьИмяЭлементаРедактированияКомментария(ПутьКДанным);
//		Форма[ИмяЭлемента]="";
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным,ФорматТекста) Экспорт
	ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	Если ФорматТекста=ВариантыФорматаТекста.Markdown Тогда
		Возврат РМ_MarkdownКлиентСервер.ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
	Иначе
		Возврат РВ_РедакторWysiwygHTMLКлиентСервер.ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
	КонецЕсли;	

КонецФункции

Функция ДанныеПрисоединенныхФайлов(Форма,ПутьКДаннымБезЛишнего, ФорматТекста) Экспорт
	ВариантыФорматаТекста=РедакторКомментарияКлиентПовтИсп.ВариантыОформленияТекстаКомментария();
	Если ФорматТекста=ВариантыФорматаТекста.Markdown Тогда
		Возврат РМ_MarkdownКлиентСервер.ДанныеПрисоединенныхФайлов(Форма,ПутьКДаннымБезЛишнего);
	Иначе
		Возврат РВ_РедакторWysiwygHTMLКлиентСервер.ДанныеПрисоединенныхФайлов(Форма,ПутьКДаннымБезЛишнего);
	КонецЕсли;	
	
КонецФункции

#КонецОбласти