
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗадачиНаСервере()
	Объект.Задачи.Очистить();
	
	ЗАпрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	RA_RedmineЗадачи.Ссылка КАК Задача,
	|	RA_RedmineЗадачи.Исполнитель.Пользователь КАК Исполнитель,
	|	RA_RedmineЗадачи.ОценкаТрудозатрат КАК КоличествоЧасов,
	|	ВЫБОР
	|		КОГДА RA_RedmineЗадачи.Статус.Платный
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОплатыЗадач.Платная)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыОплатыЗадач.Бесплатная)
	|	КОНЕЦ КАК ВидОплаты,
	|	RA_RedmineЗадачи.КонтактОбращения КАК КонтактОбращения
	|ПОМЕСТИТЬ ВыборкаЗадачОсновная
	|ИЗ
	|	Справочник.RA_RedmineЗадачи КАК RA_RedmineЗадачи
	|ГДЕ
	|	RA_RedmineЗадачи.Проект.Партнер = &Партнер
	|	И RA_RedmineЗадачи.Статус.Закрыто
	|	И RA_RedmineЗадачи.Статус.ВидСтатуса = &ВидСтатусаРедмайнаРешено
	|	И RA_RedmineЗадачи.ДатаЗакрытия >= &ДатаНачалаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Задача.Ссылка,
	|	Задача.Исполнитель,
	|	Задача.ОценкаТрудозатрат,
	|	Задача.ВидОплаты,
	|	Задача.КонтактОбращения
	|ИЗ
	|	Документ.Задача КАК Задача
	|ГДЕ
	|	Задача.Проект.Партнер = &Партнер
	|	И Задача.Статус.Вид = &ВидСтатусаЗакрыт
	|	И Задача.ДатаЗакрытия >= &ДатаНачалаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыборкаЗадачОсновная.Задача КАК Задача,
	|	ВыборкаЗадачОсновная.Исполнитель КАК Исполнитель,
	|	ВыборкаЗадачОсновная.КоличествоЧасов КАК КоличествоЧасов,
	|	ВыборкаЗадачОсновная.ВидОплаты КАК ВидОплаты,
	|	ВыборкаЗадачОсновная.КонтактОбращения КАК КонтактОбращения
	|ИЗ
	|	ВыборкаЗадачОсновная КАК ВыборкаЗадачОсновная
	|ГДЕ
	|	НЕ ВыборкаЗадачОсновная.Задача В
	|				(ВЫБРАТЬ
	|					ФормированиеЗаказаЗадачи.Задача КАК Задача
	|				ИЗ
	|					Документ.ОтчетПоРаботам.Задачи КАК ФормированиеЗаказаЗадачи
	|				ГДЕ
	|					ФормированиеЗаказаЗадачи.Ссылка.Проведен
	|					И ФормированиеЗаказаЗадачи.Ссылка <> &ТекущийДокумент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыборкаЗадачОсновная";
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("ДатаНачалаУчета", Константы.ДатаНачалаФормированияЗаказов.Получить());
	Запрос.УстановитьПараметр("ВидСтатусаРедмайнаРешено", Перечисления.RA_RedmineВидыСтатусовЗадач.Решена);
	Запрос.УстановитьПараметр("ТекущийДокумент",Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидСтатусаЗакрыт",Перечисления.ВидыСтатусовЗадач.Закрыта);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() ЦИкл
		НС=Объект.Задачи.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Выборка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗадачи(Команда)
	ЗаполнитьЗадачиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	Объект.ПериодРегистрации=НачалоМесяца(Объект.ПериодРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	Объект.ПериодРегистрации=ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

