
////////////////////////////////////////////////////////////////////////////////
// УчетВремениКлиент
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы() Экспорт

	ОбновитьПараметрВедетсяУчетВремени();

КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, Предупреждения) Экспорт

	Если ПараметрыПриложения["ВедетсяУчетВремени"] = Истина Тогда

		Отказ = Истина;

		НовоеПредупреждение = СтандартныеПодсистемыКлиент.ПредупреждениеПриЗавершенииРаботы();
		НовоеПредупреждение.ТекстПредупреждения = "ЗАВЕРШИТЕ УЧЕТ ВРЕМЕНИ ПЕРЕД ЗАВЕРШЕНИЕМ РАБОТЫ!";
		НовоеПредупреждение.ТекстГиперссылки = "Открыть форму управления таймерами";
		НовоеПредупреждение.ДействиеПриНажатииГиперссылки.Форма = "Обработка.УправлениеТаймерамиУчетаВремени.Форма.Форма";
		НовоеПредупреждение.ДействиеПриНажатииГиперссылки.ПрикладнаяФормаПредупреждения = "Обработка.УправлениеТаймерамиУчетаВремени.Форма.Форма";

		Предупреждения.Добавить(НовоеПредупреждение);

	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьПараметрВедетсяУчетВремени() Экспорт

	ПараметрыПриложения.Вставить("ВедетсяУчетВремени", ТаймерыСервер.ЕстьАктивныйТаймер());

КонецПроцедуры

Процедура ВыполнитьКомандуБыстройУстановкиЧасов(Форма, Команда, ПутьКДанным) Экспорт
	// Имя команды формируется по шаблону УстановитьЧасов_1_25 = установить 1.25 ч
	ЧастиИмени = СтрРазделить(Команда.Имя, "_");
	ЧастиИмени.Удалить(0);
	ЧастиИмени.Удалить(0);
	КоличествоЧасовСтрокой = СтрСоединить(ЧастиИмени, ".");
	Часов=СтроковыеФункцииКлиентСервер.СтрокаВЧисло(КоличествоЧасовСтрокой);

	ЧастиПутьКДанным=СтрРазделить(ПутьКДанным, ".");

	Если ЧастиПутьКДанным.Количество() = 1 Тогда
		Форма[ПутьКДанным]=Часов;
	ИначеЕсли ЧастиПутьКДанным.Количество() = 2 Тогда
		Форма[ЧастиПутьКДанным[0]][ЧастиПутьКДанным[1]]=Часов;
	КонецЕсли;
КонецПроцедуры

Процедура ОповеститьОбИзмененииТрудозатрат(Предмет) Экспорт
	Оповестить("ИзменилисьТрудозатраты",Предмет);
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти