#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
//

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Если нам не передали значение для заполнения владельца-партнера, то пытаемся 
	// установить его сами.
	ИскатьПартнера = ДанныеЗаполнения=Неопределено;
	Если Не ИскатьПартнера И ДанныеЗаполнения.Свойство("Владелец") Тогда
		АнализДанных = Новый Структура("Владелец");
		ЗаполнитьЗначенияСвойств(АнализДанных, ДанныеЗаполнения, "Владелец");
		ИскатьПартнера = Не ЗначениеЗаполнено(АнализДанных.Владелец);
	КонецЕсли;
	
	Если ИскатьПартнера Тогда
		Запрос = Новый Запрос("
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
			|	Партнеры.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|ГДЕ
			|	НЕ Партнеры.ПометкаУдаления
			|");
		Партнеры = Запрос.Выполнить().Выгрузить();
		// Можем устанавливать, только если доступен один из всех.
		Если Партнеры.Количество()=1 Тогда
			Владелец = Партнеры[0].Ссылка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
