
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Для Каждого Задача Из ПараметрКоманды Цикл
		Если ПринятьЗадачуНаСервере(Задача) Тогда
			ОповеститьОбИзменении(Задача);
			Оповестить("ИзмененаЗадача", Задача);
			ТаймерыКлиент.СоздатьИСтартоватьТаймерПоПредмету(Задача);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПринятьЗадачуНаСервере(Задача)
	
	СтатусыНеВыполненныхЗадач = УправлениеЗадачамиПовтИсп.СтатусыНеВыполненныхЗадач();
	
	Объект = Задача.ПолучитьОбъект();
	
	Если СтатусыНеВыполненныхЗадач.НайтиПоЗначению(Объект.Статус) = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Действие недопустимо для выполненных задач",Задача);
		Возврат Ложь;
	КонецЕсли;
	
	Объект.Исполнитель = Пользователи.ТекущийПользователь();
	Объект.Статус = УправлениеЗадачамиПовтИсп.СтатусЗадачиВРаботе();
	Объект.Записать();
	
	Возврат Истина;
	
КонецФункции
