
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УтвердитьОтчетыПоРаботам(ПараметрКоманды);
КонецПроцедуры

&НаСервере
Процедура УтвердитьОтчетыПоРаботам(МассивДокументов)
	Для Каждого ТекДокумент Из МассивДокументов Цикл
		Если ТекДокумент.Статус <> Перечисления.СтатусыОтчетовПоРаботамПартнеру.Формируется Тогда
			Продолжить;
		КонецЕсли;
		ДокОбъект = ТекДокумент.ПолучитьОбъект();
		ДокОбъект.Статус = Перечисления.СтатусыОтчетовПоРаботамПартнеру.Утвержден;
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось утвердить документ "+ ДокОбъект+": "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры