
Процедура ПередЗаписью(Отказ)
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// запишем статус Новый на дату создания задачи
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		
		Запись = РегистрыСведений.RA_RedmineИсторияСтатусовЗадач.СоздатьМенеджерЗаписи();
		Запись.Период = ДатаСоздания;
		Запись.Задача = Ссылка;
		Запись.Статус = RA_RedmineПротоколПодключенияПовтИсп.СтатусЗадачиНовый();
		Запись.Пользователь = Автор;
		Запись.Комментарий = "Установлен автоматически при создании задачи";
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
