Функция ВерсияПодсистемы() Экспорт
	Возврат "1.0";
КонецФункции

Функция ПрефиксЭлементовФормы() Экспорт
	Возврат "РВ_Wysiwyg_";
КонецФункции

Функция ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным) Экспорт
	Возврат СтрЗаменить(ПутьКДанным,".","_");
КонецФункции

Функция ПолучитьПутьКДаннымИЗПутиБезЛишнего(ПутьКДаннымБезЛишнего) Экспорт
	Возврат СтрЗаменить(ПутьКДаннымБезЛишнего,"_",".");
КонецФункции

Функция ПолучитьИмяГруппыРедактированияКомментария(ПутьКДанным) Экспорт
	Возврат ПрефиксЭлементовФормы()+"Группа_Редактирование_"+ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);	
КонецФункции


Функция ПолучитьИмяЭлементаРедактированияКомментария(ПутьКДанным) Экспорт
	Возврат ПрефиксЭлементовФормы()+ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
КонецФункции

Функция ПолучитьПутьКДаннымПоИмениПоляРедактирования(ИмяПанели) Экспорт
	СтрокаЗамены=ПрефиксЭлементовФормы();
	ПутьКДаннымБезЛишнего=СтрЗаменить(ИмяПанели,СтрокаЗамены,"");
	Возврат ПолучитьПутьКДаннымИЗПутиБезЛишнего(ПутьКДаннымБезЛишнего);
КонецФункции



Функция ИмяТаблицыПрисоединенныхФайлов(ПутьКДаннымБезЛишнего) Экспорт
	Возврат ПрефиксЭлементовФормы()+"ТаблицаПрисоединенныхФайлов_"+ПутьКДаннымБезЛишнего;
КонецФункции

Функция ИмяГруппыНовыхПрисоединенныхФайлов(ПутьКДаннымБезЛишнего) Экспорт
	Возврат ПрефиксЭлементовФормы()+"НовыеПрисоединенныеФайлы_"+ПутьКДаннымБезЛишнего;
КонецФункции

Функция ИмяЭлементаНадписиНовогоПрисоединеногоФайла(ПутьКДаннымБезЛишнего, ИдентификаторСтроки) Экспорт
	Возврат ПрефиксЭлементовФормы()+ИмяЭлементаНадписиНовогоПрисоединеногоФайлаБезПрефикса(ПутьКДаннымБезЛишнего, ИдентификаторСтроки);
КонецФункции

Функция ИмяЭлементаНадписиНовогоПрисоединеногоФайлаБезПрефикса(ПутьКДаннымБезЛишнего, ИдентификаторСтроки) Экспорт
	Возврат "ПрисоединенныйФайл_" + Формат(ИдентификаторСтроки,"ЧН=0; ЧГ=0;")+"_"+ПутьКДаннымБезЛишнего;
КонецФункции

Функция ИмяГруппыНовогоПрисоединеногоФайла(ПутьКДаннымБезЛишнего, ИдентификаторСтроки) Экспорт
	Возврат ПрефиксЭлементовФормы()+"Группа_"+ИмяЭлементаНадписиНовогоПрисоединеногоФайлаБезПрефикса(ПутьКДаннымБезЛишнего, ИдентификаторСтроки);
КонецФункции

Функция ИмяГруппыКомандНовогоПрисоединеногоФайла(ПутьКДаннымБезЛишнего, ИдентификаторСтроки) Экспорт
	Возврат ПрефиксЭлементовФормы()+"ГруппаКоманд_"+ИмяЭлементаНадписиНовогоПрисоединеногоФайлаБезПрефикса(ПутьКДаннымБезЛишнего, ИдентификаторСтроки);
КонецФункции

Функция ИмяКомандыУдалитьНовогоПрисоединеногоФайла(ПутьКДаннымБезЛишнего, ИдентификаторСтроки) Экспорт
	Возврат ПрефиксЭлементовФормы()+"Удалить"+ИмяЭлементаНадписиНовогоПрисоединеногоФайлаБезПрефикса(ПутьКДаннымБезЛишнего, ИдентификаторСтроки);
КонецФункции

Функция ИмяКомандыОткрытьНовогоПрисоединеногоФайла(ПутьКДаннымБезЛишнего, ИдентификаторСтроки) Экспорт
	Возврат ПрефиксЭлементовФормы()+"Открыть"+ИмяЭлементаНадписиНовогоПрисоединеногоФайлаБезПрефикса(ПутьКДаннымБезЛишнего, ИдентификаторСтроки);
КонецФункции

Функция ИмяКомандыВставитьНовогоПрисоединеногоФайла(ПутьКДаннымБезЛишнего, ИдентификаторСтроки) Экспорт
	Возврат ПрефиксЭлементовФормы()+"Вставить"+ИмяЭлементаНадписиНовогоПрисоединеногоФайлаБезПрефикса(ПутьКДаннымБезЛишнего, ИдентификаторСтроки);
КонецФункции

Функция ТекстКомментария(Форма, ПутьКДанным) Экспорт
	МассивПути=СтрРазделить(ПутьКДанным, ".", Ложь);
	Если МассивПути.Количество() = 1 Тогда
		ТекстКомментария=Форма[МассивПути[0]];
	ИначеЕсли МассивПути.Количество() = 2 Тогда
		ТекстКомментария=Форма[МассивПути[0]][МассивПути[1]];
	Иначе
		ТекстКомментария="";
	КонецЕсли;
	
	Возврат ТекстКомментария;
КонецФункции

Процедура УстановитьТекстКомментария(Форма, ПутьКДанным, НовыйКомментарий) Экспорт
	МассивПути=СтрРазделить(ПутьКДанным, ".", Ложь);
	Если МассивПути.Количество() = 1 Тогда
		Форма[МассивПути[0]]=НовыйКомментарий;
	ИначеЕсли МассивПути.Количество() = 2 Тогда
		Форма[МассивПути[0]][МассивПути[1]]=НовыйКомментарий;
	КонецЕсли;
КонецПроцедуры

Процедура СконвертироватьИмяПрисоединенногоФайлаВТексте(Текст,ИмяФайла,Адрес, СсылкаНаФайл) Экспорт
		//Для Каждого Вложение Из ДанныеПрисоединенныхФайлов Цикл
			Текст=СтрЗаменить(Текст,"src=""cid:"+Строка(СсылкаНаФайл)+"""","src="""+Адрес+"""");
			Текст=СтрЗаменить(Текст,"src="""+Строка(СсылкаНаФайл)+"""","src="""+Адрес+"""");
		//	//ТекЗапись.ТекстСообщения=СтрЗаменить(ТекЗапись.ТекстСообщения,"cid:"+Строка(Вложение.ИмяФайла),"Адрес");
		//КонецЦикла;
	
	//СтрокаПоиска = СтрШаблон("![](%1)", ИмяФайла);
	//СтрокаЗамены = СтрШаблон("![](%1)", Адрес);
	//
	//Текст = СтрЗаменить(Текст, СтрокаПоиска, СтрокаЗамены);
КонецПроцедуры

Процедура СконвертироватьИменаПрисоединенныхФайловВТексте(ДанныеПрисоединенныхФайлов, Текст) Экспорт
	
	Для Каждого ДанныеФайла Из ДанныеПрисоединенныхФайлов Цикл
		
		СконвертироватьИмяПрисоединенногоФайлаВТексте(Текст,ДанныеФайла.ИмяФайла,ДанныеФайла.Адрес, ДанныеФайла.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

// Раскладывает полное имя файла на составляющие.
//
// Параметры:
//  ПолноеИмяФайла - Строка - полный путь к файлу.
//  ЭтоПапка - Булево - признак того, что требуется разложить полное имя папки, а не файла.
//
// Возвращаемое значение:
//   Структура - имя файла, разложенное на составные части(аналогично свойствам объекта Файл):
//		ПолноеИмя - содержит полный путь к файлу, т.е. полностью соответствует входному параметру ПолноеИмяФайла.
//		Путь - содержит путь к каталогу, в котором лежит файл.
//		Имя - содержит имя файла с расширением, без пути к файлу.
//		Расширение - содержит расширение файла.
//		ИмяБезРасширения - содержит имя файла без расширения и без пути к файлу.
//			Пример: если ПолноеИмяФайла = "c:\temp\test.txt", то структура заполнится следующим образом:
//				ПолноеИмя: "c:\temp\test.txt".
//				Путь: "c:\temp\"
//				Имя: "test.txt"
//				Расширение: ".txt"
//				ИмяБезРасширения: "test".
//
Функция РазложитьПолноеИмяФайла(Знач ПолноеИмяФайла, ЭтоПапка = Ложь) Экспорт
	
	СтруктураИмениФайла = Новый Структура("ПолноеИмя,Путь,Имя,Расширение,ИмяБезРасширения");
	
	// Убираем из полного имени файла завершающий слеш и сохраняем получившееся полное имя в структуре.
	Если ЭтоПапка И (Прав(ПолноеИмяФайла, 1) = "/" Или Прав(ПолноеИмяФайла, 1) = "\") Тогда
		Если ЭтоПапка Тогда
			ПолноеИмяФайла = Сред(ПолноеИмяФайла, 1, СтрДлина(ПолноеИмяФайла) - 1);
		Иначе
			// Если путь к файлу заканчивается слешем, то у файла нет имени.
			СтруктураИмениФайла.Вставить("ПолноеИмя", ПолноеИмяФайла); 
			СтруктураИмениФайла.Вставить("Путь", ПолноеИмяФайла); 
			СтруктураИмениФайла.Вставить("Имя", ""); 
			СтруктураИмениФайла.Вставить("Расширение", ""); 
			СтруктураИмениФайла.Вставить("ИмяБезРасширения", ""); 
			Возврат СтруктураИмениФайла;
		КонецЕсли;
	КонецЕсли;
	СтруктураИмениФайла.Вставить("ПолноеИмя", ПолноеИмяФайла); 
	
	// Если полное имя файла оказалось пустым, то остальные параметры структуры возвращаем пустыми.
	Если СтрДлина(ПолноеИмяФайла) = 0 Тогда 
		СтруктураИмениФайла.Вставить("Путь", ""); 
		СтруктураИмениФайла.Вставить("Имя", ""); 
		СтруктураИмениФайла.Вставить("Расширение", ""); 
		СтруктураИмениФайла.Вставить("ИмяБезРасширения", ""); 
		Возврат СтруктураИмениФайла;
	КонецЕсли;
	
	// Выделяем путь к файлу и имя файла.
	Если СтрНайти(ПолноеИмяФайла, "/") > 0 Тогда
		ПозицияРазделителя = СтрНайти(ПолноеИмяФайла, "/", НаправлениеПоиска.СКонца);
	ИначеЕсли СтрНайти(ПолноеИмяФайла, "\") > 0 Тогда
		ПозицияРазделителя = СтрНайти(ПолноеИмяФайла, "\", НаправлениеПоиска.СКонца);
	Иначе
		ПозицияРазделителя = 0;
	КонецЕсли;
	СтруктураИмениФайла.Вставить("Путь", Лев(ПолноеИмяФайла, ПозицияРазделителя)); 
	СтруктураИмениФайла.Вставить("Имя", Сред(ПолноеИмяФайла, ПозицияРазделителя + 1));
	
	// Папки не имеют расширений, а для файла выделяем расширение.
	Если ЭтоПапка Тогда
		СтруктураИмениФайла.Вставить("Расширение", "");
		СтруктураИмениФайла.Вставить("ИмяБезРасширения", СтруктураИмениФайла.Имя);
	Иначе
		ПозицияТочки = СтрНайти(СтруктураИмениФайла.Имя, ".", НаправлениеПоиска.СКонца);
		Если ПозицияТочки = 0 Тогда
			СтруктураИмениФайла.Вставить("Расширение", "");
			СтруктураИмениФайла.Вставить("ИмяБезРасширения", СтруктураИмениФайла.Имя);
		Иначе
			СтруктураИмениФайла.Вставить("Расширение", Сред(СтруктураИмениФайла.Имя, ПозицияТочки));
			СтруктураИмениФайла.Вставить("ИмяБезРасширения", Лев(СтруктураИмениФайла.Имя, ПозицияТочки - 1));
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураИмениФайла;
	
КонецФункции

Функция ДанныеПрисоединенныхФайлов(Форма,ПутьКДаннымБезЛишнего) Экспорт
	ИмяТаблицыПрисоединенныхФайлов=РВ_РедакторWysiwygHTMLКлиентСервер.ИмяТаблицыПрисоединенныхФайлов(ПутьКДаннымБезЛишнего);
	
	ДанныеПрисоединенныхФайлов = Новый Массив;
	Для Каждого СтрокаФайла Из Форма[ИмяТаблицыПрисоединенныхФайлов] Цикл
		ДанныеФайла = Новый Структура("ИмяФайла,Адрес,Ссылка,ПутьКФайлу,ЭтоНовый", СтрокаФайла.ИмяФайла,СтрокаФайла.Адрес,СтрокаФайла.Ссылка,СтрокаФайла.ПутьКФайлу,СтрокаФайла.ЭтоНовый);
		ДанныеПрисоединенныхФайлов.Добавить(ДанныеФайла);
	КонецЦикла;
	
	Возврат ДанныеПрисоединенныхФайлов;
	
КонецФункции
