#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Возврат РаботаСФайлами.РеквизитыРедактируемыеВГрупповойОбработке();
	
КонецФункции

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	// Имеющиеся ограничения доступа в ролях:
	// 
	// Чтение
	// #ПоЗначениям( "Справочник.ЦПР_ПодключенияПрисоединенныеФайлы","","",
	// "Партнеры", "ВладелецФайла.Владелец.Партнер",
	// "ВидыПодключения","ВладелецФайла.ВидПодключения",
	//  "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","")
	// 
	// Чтение
	// #ПоЗначениям( "Справочник.ЦПР_ПодключенияПрисоединенныеФайлы","","",
	// "Партнеры", "ВладелецФайла.Владелец.Партнер",
	// "ВидыПодключения","ВидПодключения",
	//  "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","")
	// 
	// Изменение
	// #ПоЗначениям( "Справочник.ЦПР_ПодключенияПрисоединенныеФайлы","","",
	// "Партнеры", "ВладелецФайла.Владелец.Партнер",
	// "ВидыПодключения","ВидПодключения",
	//  "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","", "","")
	// 
	// 
	// TODO: Найдено более одного варианта текста ограничения чтения
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(ВладелецФайла)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ИзменениеОбъектаРазрешено(ВладелецФайла)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
