
&НаКлиенте
Процедура ПоказатьПароль(Команда)
	
	Элементы.Пароль.РежимПароля=Не Элементы.Пароль.РежимПароля;
	Если Элементы.Пароль.РежимПароля Тогда
		Элементы.ПоказатьПароль.Заголовок="Показать пароль";
	Иначе
		Элементы.ПоказатьПароль.Заголовок="Скрыть пароль";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_УчетныеДанныеПодключений");
КонецПроцедуры

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура УстановитьПартнераФормы()
	Партнер=Запись.ТочкаПодключения.Владелец.Партнер;
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", Партнер);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Пользователь.ПараметрыВыбора = НовыеПараметры;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПартнераФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТочкаПодключенияПриИзменении(Элемент)
	УстановитьПартнераФормы();
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти
