
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗапуститьПриложение(АдресЗначения(ПараметрКоманды));
	
КонецПроцедуры

&НаСервере
Функция АдресЗначения(ПараметрКоманды)
	
	АдресСервера = RA_RedmineПротоколПодключенияПовтИсп.ПолучитьПараметрыПодключения().АдресСервера;
	
	Путь = "";
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.RA_RedmineЗадачи") Тогда
		Путь = СтрШаблон("/issues/%1", ПараметрКоманды.Код);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.RA_RedmineТрудозатраты") Тогда
		Путь = СтрШаблон("/time_entries/%1/edit", ПараметрКоманды.Код);
	КонецЕсли;
		
	Возврат "http://" + АдресСервера + Путь;
	
КонецФункции
