Функция ПолучитьНастройкуПодключенияПоУмолчанию() Экспорт
	
	Возврат Константы.RA_ОсновнаяНастройкаОбменаСRedmine.Получить();
	
КонецФункции

Функция ПолучитьПараметрыПодключения(НастройкаПодключения=Неопределено) Экспорт
	
	Если НастройкаПодключения=Неопределено Тогда
		НастройкаПодключения=ПолучитьНастройкуПодключенияПоУмолчанию();
	КонецЕсли;
	
	СтруктураПараметров = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаПодключения, 
		"АдресСервера, Логин, Пароль, КлючAPI, ИспользоватьHTTPS, УровеньЛогирования, ЗагружатьИзмененияЗадач");
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция СтатусЗадачиНовый() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	RA_RedmineСтатусы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.RA_RedmineСтатусы КАК RA_RedmineСтатусы
	|ГДЕ
	|	RA_RedmineСтатусы.ВидСтатуса = &ВидСтатуса";
	Запрос.УстановитьПараметр("ВидСтатуса", Перечисления.RA_RedmineВидыСтатусовЗадач.Новая);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		ВызватьИсключение "Не найдено ни одного статуса задачи с видом статуса ""Новый"".";
	КонецЕсли;
	
КонецФункции

Функция ПроектПропущенныеЗвонки() Экспорт
	
	Возврат Справочники.RA_RedmineПроекты.НайтиПоКоду("195");
	
КонецФункции
