Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.СпискиСтатусовЗадач");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗадач.Ссылка КАК Ссылка,
	|	СтатусыЗадач.Вид КАК Вид,
	|	СтатусыЗадач.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
	|ИЗ
	|	Справочник.СтатусыЗадач КАК СтатусыЗадач
	|ГДЕ
	|	НЕ СтатусыЗадач.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Список_Новые = Справочники.СпискиСтатусовЗадач.Новые.ПолучитьОбъект();
	Список_ВРаботе = Справочники.СпискиСтатусовЗадач.ВРаботе.ПолучитьОбъект();
	Список_Выполненные = Справочники.СпискиСтатусовЗадач.Выполненные.ПолучитьОбъект();
	Список_Закрытые = Справочники.СпискиСтатусовЗадач.Закрытые.ПолучитьОбъект();
	Список_Открытые = Справочники.СпискиСтатусовЗадач.Открытые.ПолучитьОбъект();
	Список_НеВыполненные = Справочники.СпискиСтатусовЗадач.НеВыполненные.ПолучитьОбъект();
	Список_КВыполнению = Справочники.СпискиСтатусовЗадач.КВыполнению.ПолучитьОбъект();
	Список_Отклоненные = Справочники.СпискиСтатусовЗадач.Отклоненные.ПолучитьОбъект();
	
	Список_Новые.Статусы.Очистить();
	Список_ВРаботе.Статусы.Очистить();
	Список_Выполненные.Статусы.Очистить();
	Список_Закрытые.Статусы.Очистить();
	Список_Открытые.Статусы.Очистить();
	Список_НеВыполненные.Статусы.Очистить();
	Список_КВыполнению.Статусы.Очистить();
	Список_Отклоненные.Статусы.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Вид = Перечисления.ВидыСтатусовЗадач.Новая Тогда
			Список_Новые.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_Открытые.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_НеВыполненные.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_КВыполнению.Статусы.Добавить().Статус = Выборка.Ссылка;
		КонецЕсли;
		
		Если Выборка.Вид = Перечисления.ВидыСтатусовЗадач.ВРаботе Тогда
			Список_ВРаботе.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_Открытые.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_НеВыполненные.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_КВыполнению.Статусы.Добавить().Статус = Выборка.Ссылка;
		КонецЕсли;
		
		Если Выборка.Вид = Перечисления.ВидыСтатусовЗадач.Выполнена Тогда
			Список_Выполненные.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_Открытые.Статусы.Добавить().Статус = Выборка.Ссылка;
		КонецЕсли;
		
		Если Выборка.Вид = Перечисления.ВидыСтатусовЗадач.Закрыта Тогда
			Список_Закрытые.Статусы.Добавить().Статус = Выборка.Ссылка;
		КонецЕсли;
		
		Если Выборка.Вид = Перечисления.ВидыСтатусовЗадач.Отклонена Тогда
			Список_Отклоненные.Статусы.Добавить().Статус = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Список_Новые.Описание = "Все новые задачи. Возможно, требуется согласование";
	Список_ВРаботе.Описание = "Задачи, в настоящий момент находящиеся в работе";
	Список_Выполненные.Описание = "Задачи, выполненные нами, но ожидающие дополнительного действия. 
									|Например, задача сделана, но не выложена на рабочую базу
									|Или требуется обратная связь от клиента";
	Список_Закрытые.Описание = "Все закрытые задачи";
	Список_Открытые.Описание = "Все открытые задачи";
	Список_НеВыполненные.Описание = "Все не выполненные нами задачи (новые, в работе, на согласовании стоимости и т.п.";
	Список_КВыполнению.Описание = "Задачи, находящиеся в работе и те, которые можно брать в работу";
	Список_Отклоненные.Описание = "Отклоненные нами задачи (дубли, некорректно поставленные задачи и т.п.)";
	
	Список_Новые.Записать();
	Список_ВРаботе.Записать();
	Список_Выполненные.Записать();
	Список_Закрытые.Записать();
	Список_Открытые.Записать();
	Список_НеВыполненные.Записать();
	Список_КВыполнению.Записать();
	Список_Отклоненные.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
