
&НаКлиенте
Процедура НастройкиТранспортаПриАктивизацииСтроки(Элемент)
	ТекДанные=Элементы.НастройкиТранспорта.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДополнительныеПолучателиОповещений.ОтборСтрок=Новый ФиксированнаяСтруктура("КлючСтроки", ТекДанные.КлючСтроки);
	ОбновитьОтображениеДанных();
КонецПроцедуры



&НаКлиенте
Процедура НастройкиТранспортаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные=Элементы.НастройкиТранспорта.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.КлючСтроки) Тогда
		ТекДанные.КлючСтроки=Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиОповещенийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекДанныеНастройки=Элементы.НастройкиТранспорта.ТекущиеДанные;
	Если ТекДанныеНастройки=Неопределено Тогда
		ОтменаРедактирования=Истина;
		Возврат;
	КонецЕсли;
	
	
	ТекДанные=Объект.ДополнительныеПолучателиОповещений.НайтиПоИдентификатору(Элементы.ДополнительныеПолучателиОповещений.ТекущаяСтрока);
	
	Если Не ЗначениеЗаполнено(ТекДанные.КлючСтроки) Тогда
		ТекДанные.КлючСтроки=ТекДанныеНастройки.КлючСтроки;
	КонецЕсли;
КонецПроцедуры

