
&НаКлиенте
//
//
Процедура Ок(Команда)
	ПараметрыТестирования = ЗадачиНаСервере.ПолучитьСтруктуруПараметровТестирования();
	ПараметрыТестирования.РеиндексацияТаблиц = РеиндексацияТаблиц;
	ПараметрыТестирования.ПроверкаЛогическойЦелостности = ПроверкаЛогическойЦелостности;
	ПараметрыТестирования.ПроверкаСсылочнойЦелостности = ПроверкаСсылочнойЦелостности;	
	ПараметрыТестирования.ПересчетИтогов = ПересчетИтогов;
	ПараметрыТестирования.СжатиеТаблиц = СжатиеТаблиц;
	ПараметрыТестирования.РеструктуризацияТаблиц = РеструктуризацияТаблиц;
	ПараметрыТестирования.ТолькоТестирование = ТолькоТестирование;
	ПараметрыТестирования.ОперацияПоНесуществующимСсылкам = ОперацияПоНесуществующимСсылкам;
	ПараметрыТестирования.ОперацияПриЧастичноПотереОбъектов = ОперацияПриЧастичноПотереОбъектов;
	ЗакрытьФорму(ПараметрыТестирования);
КонецПроцедуры

&НаКлиенте
//
//
Процедура Отмена(Команда)
	ЗакрытьФорму(Неопределено);
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗакрытьФорму(ПараметрыТестирования)
	ЭтаФорма.Закрыть(ПараметрыТестирования);
КонецПроцедуры


&НаКлиенте
//
//
Процедура ТолькоТестированиеПриИзменении(Элемент)
	ОперацияПоНесуществующимСсылкам = 0;
	Элементы.ОперацияПоНесуществующимСсылкам.Доступность = НЕ ТолькоТестирование;
	
	ОперацияПриЧастичноПотереОбъектов = 0;
	Элементы.ОперацияПриЧастичноПотереОбъектов.Доступность = НЕ ТолькоТестирование;
КонецПроцедуры

