Процедура ПередЗаписьюОбъектаФормированиеДанныйДляОповещений(Источник, Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОповещенияПоЗадачам.ПередЗаписьюОбъектаФормированиеДанныхДляОповещений(Источник, Отказ);
КонецПроцедуры

Процедура ПередЗаписьюКомментарияФормированиеДанныйДляОповещений(Источник, Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	ОповещенияПоЗадачам.ПередЗаписьюОбъектаФормированиеДанныхДляОповещений(Источник, Отказ);
КонецПроцедуры

Процедура ПередЗаписьюЗадачиФормированиеДанныйДляОповещенийПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОповещенияПоЗадачам.ПередЗаписьюОбъектаФормированиеДанныхДляОповещений(Источник, Отказ);
КонецПроцедуры

Процедура ПриЗаписиОбъектаФормированиеОпововещенийКОтправкеПриЗаписи(Источник, Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("БезОповещений") Тогда
		Возврат;
	КонецЕсли;
	
	ОповещенияПоЗадачам.ПриЗаписиОбъектаФормированиеДанныхОповещений(Источник, Отказ);
КонецПроцедуры


