///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает наименования видов контактной информации на разных языках.
//
// Параметры:
//  Наименования - Соответствие - представление вида контактной информации на переданном языке:
//     * Ключ     - Строка - Имя вида контактной информации. Например, "_ДемоАдресПартнера".
//     * Значение - Строка - Наименование вида контактной информации для переданного кода языка.
//  КодЯзыка - Строка - Код языка. Например, "en".
//
// Пример:
//  Наименования["_ДемоАдресПартнера"] = НСтр("ru='Адрес'; en='Address';", КодЯзыка);
//
Процедура ПриПолученииНаименованийВидовКонтактнойИнформации(Наименования, КодЯзыка) Экспорт
	
	// Контактная информация справочника "Партнеры"
	Наименования["АдресПартнера"]   = НСтр("ru='Адрес';", КодЯзыка);
	Наименования["ТелефонПартнера"] = НСтр("ru='Телефон партнера';", КодЯзыка);
	Наименования["EmailПартнера"]   = НСтр("ru='Электронная почта партнера';", КодЯзыка);
	Наименования["ВебСайтПартнера"] = НСтр("ru='Веб-сайт';", КодЯзыка);
	
	// Контактная информация справочника "Демо: Организации"
	Наименования["ЮридическийАдресОрганизации"]   = НСтр("ru='Юридический адрес';", КодЯзыка);
	Наименования["ФактическийАдресОрганизации"]   = НСтр("ru='Фактический адрес';", КодЯзыка);
	Наименования["ПочтовыйАдресОрганизации"]      = НСтр("ru='Почтовый адрес';", КодЯзыка);
	Наименования["МеждународныйАдресОрганизации"] = НСтр("ru='Международный адрес для платежей / Address for payments';", КодЯзыка);
	Наименования["ТелефонОрганизации"]            = НСтр("ru='Телефон';", КодЯзыка);
	Наименования["ФаксОрганизации"]               = НСтр("ru='Факс';", КодЯзыка);
	Наименования["EmailОрганизации"]              = НСтр("ru='Электронная почта';", КодЯзыка);
	Наименования["ДругаяИнформацияОрганизации"]   = НСтр("ru='Другое';", КодЯзыка);
	
	// Контактная информация справочника "Контрагенты"
	Наименования["АдресКонтрагента"] = НСтр("ru='Адрес';", КодЯзыка);
	Наименования["EmailКонтрагента"] = НСтр("ru='Электронная почта';", КодЯзыка);
	Наименования["SkypeКонтрагенты"] = НСтр("ru='Skype';", КодЯзыка);
	
	// Контактная информация справочника "Контактные лица партнеров"
	Наименования["АдресКонтактногоЛица"] = НСтр("ru='Адрес контактного лица';", КодЯзыка);
	Наименования["EmailКонтактногоЛица"] = НСтр("ru='Электронная почта контактного лица';", КодЯзыка);
	
	// Контактная информация справочника "Демо: Физические лица"
	Наименования["EmailФизическогоЛица"] = НСтр("ru='Электронная почта';", КодЯзыка);
	
	// Контактная информация табличной части "Партнеры и контактные лица"
	// Контактная информация документа "Заказ покупателя"
	Наименования["ПартнерыИКонтактныеЛицаАдресПартнера"]   = НСтр("ru='Адрес партнера';", КодЯзыка);
	Наименования["ПартнерыИКонтактныеЛицаТелефонПартнера"] = НСтр("ru='Телефон партнера';", КодЯзыка);
	Наименования["ПартнерыИКонтактныеЛицаEmailПартнера"]   = НСтр("ru='Электронная почта';", КодЯзыка);
	
	
КонецПроцедуры

#КонецОбласти
