#Область ПрограммныйИнтерфейс

Процедура ВыполнитьОтправкуСообщения(Сообщение, УчетнаяЗаписьОповещений, ОписаниеОшибки, НастройкиОтправкиОповещения) Экспорт
	Если Сообщение.Получатель.Количество() = 0 Тогда
		ОписаниеОшибки  = НСтр(
			"ru = 'Сообщение не может быть отправлено сразу, т.к необходимо ввести адрес электронной почты.'");
		Возврат;
	КонецЕсли;

	Если Не СистемаВзаимодействия.ИспользованиеДоступно() Тогда
		ОписаниеОшибки  = НСтр(
			"ru = 'Система взаимодействия не подключена. Отпавка невозможна'");
		Возврат;
	КонецЕсли;
	
	ТекстСообщения="";
	Если ЗначениеЗаполнено(Сообщение.Тема) Тогда
		ТекстСообщения=Сообщение.Тема + Символы.ПС + Символы.ПС;
	КонецЕсли;
	ТекстСообщения=ТекстСообщения + Сообщение.Текст;
	ПользовательДляОповещения = ИдентификаторПользователяСистемыВзаимодействияПоИмениПользователя(УчетнаяЗаписьОповещений.ИмяПользователяСистемыВзаимодействий);
	Для Каждого ТекПолучательСообщения Из Сообщение.Получатель Цикл
//		Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(Новый ИдентификаторОбсужденияСистемыВзаимодействия(ТекПолучательСообщения.Адрес));
//		Если Обсуждение = Неопределено Тогда
////			ОписаниеОшибки  = НСтр("ru = 'Не удалось найти обсуждение системы взаимодействия'");
//			Продолжить;
//		КонецЕсли;
		Автор = ПользовательДляОповещения;
		Если НастройкиОтправкиОповещения.УстанавливатьОтправителемУведомленияАвтораСобытия Тогда
			ИдентификаторАвтора = ИдентификаторПользователяСистемыВзаимодействияПоПользователю(НастройкиОтправкиОповещения.Автор);
			Если ЗначениеЗаполнено(ИдентификаторАвтора) Тогда
				Автор = ИдентификаторАвтора;
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(ТекПолучательСообщения.Адрес) = Тип("ИдентификаторПользователяСистемыВзаимодействия") Тогда
			ИдентификаторОбсуждения = ИдентификаторЛичногоОбсужденияСистемыВзаимодействий(ПользовательДляОповещения,
																						  ТекПолучательСообщения.Адрес);
		Иначе
			ИдентификаторОбсуждения = Новый ИдентификаторОбсужденияСистемыВзаимодействия(ТекПолучательСообщения.Адрес);


		КонецЕсли;
		СообщениеСистемы = СистемаВзаимодействия.СоздатьСообщение(ИдентификаторОбсуждения);
		СообщениеСистемы.Текст = ТекстСообщения;
		СообщениеСистемы.Автор = Автор;

		СообщениеСистемы.Данные = НастройкиОтправкиОповещения.ДанныеСобытия.Задача;
		Если ТипЗнч(ТекПолучательСообщения.Адрес) = Тип("ИдентификаторПользователяСистемыВзаимодействия") Тогда
			СообщениеСистемы.Получатели.Добавить(ТекПолучательСообщения.Адрес);
		Иначе
			СообщениеСистемы.Получатели.Добавить(СистемаВзаимодействия.СтандартныеПользователи.ВсеПользователиПриложения);
		КонецЕсли;
		
		СообщениеСистемы.ПанельКнопок.ВидКнопок=ВидКнопкиПанелиКнопокСообщенияСистемыВзаимодействия.ОбычнаяКнопка;

		РядКнопок = СообщениеСистемы.ПанельКнопок.РядыКнопок.Добавить();
		КнопкаРяда = РядКнопок.Добавить(ДействиеКнопкиПанелиКнопокСообщенияСистемыВзаимодействия.ПерейтиПоНавигационнойСсылке,
										"Открыть задачу");
		КнопкаРяда.Данные = НастройкиОтправкиОповещения.ДанныеСобытия.Задача;
		КнопкаРяда.Картинка = БиблиотекаКартинок.Задачи;
		КнопкаРяда.НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(НастройкиОтправкиОповещения.ДанныеСобытия.Задача);
		СообщениеСистемы.Записать();
	КонецЦикла;
КонецПроцедуры

// Адрес получателя.
// 
// Параметры:
//  Получатель - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  Строка - Адрес получателя
Функция АдресПолучателя(Получатель) Экспорт
	Если ТипЗнч(Получатель) <> Тип("СправочникСсылка.Пользователи") Тогда
		Возврат "";
	КонецЕсли;
	
	Идентификатор = ИдентификаторПользователяСистемыВзаимодействияПоПользователю(Получатель);
	Если Идентификатор = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Идентификатор;

КонецФункции

Функция ТекстИзмененийДляСообщения(Изменения) Экспорт
	ТекстИзменений=Новый Массив;

	Если Изменения.Количество() > 0 Тогда
		ЖирныйШрифт = Новый Шрифт(, , Истина);
		НаклонныйШрифт = Новый Шрифт(,,,Истина);
//		ТекстИзменений="---" + Символы.ПС + Символы.ПС;
		Для Каждого ТекИзменение Из Изменения Цикл
			ЧастиСтрокиИзменения = Новый Массив;
			ЧастиСтрокиИзменения.Добавить("- Параметр ");
			ЧастиСтрокиИзменения.Добавить(Новый ФорматированнаяСтрока(СокрЛП(ТекИзменение.Значение.Синоним),
																	  ЖирныйШрифт));
			ЧастиСтрокиИзменения.Добавить(" изменился с ");
			ЧастиСтрокиИзменения.Добавить(Новый ФорматированнаяСтрока(СокрЛП(ТекИзменение.Значение.ПредыдущееЗначение),
																	  НаклонныйШрифт));
			ЧастиСтрокиИзменения.Добавить(" на ");
			ЧастиСтрокиИзменения.Добавить(Новый ФорматированнаяСтрока(СокрЛП(ТекИзменение.Значение.Значение),
																	  НаклонныйШрифт));
			ЧастиСтрокиИзменения.Добавить(Символы.ПС);

			ТекстИзменений.Добавить(Новый ФорматированнаяСтрока(ЧастиСтрокиИзменения));
		КонецЦикла;

	КонецЕсли;
	Возврат Новый ФорматированнаяСтрока(ТекстИзменений);
КонецФункции

Функция ТекстКомментарияПреобразованный(Инициатор, Знач КомментарийИзБазы, Сообщение) Экспорт
	Если Сообщение.ДополнительныеПараметры.ФорматКомментария=Перечисления.ФорматыТекстаКомментариев.Markdown Тогда
		Возврат КомментарийИзБазы;
	КонецЕсли;
	
	ТекстКомментария=КомментарийИзБазы;
	ТекстКомментария=ОповещенияПоЗадачам.ИзвлеченныйТекстИзHTML(ТекстКомментария);
	Возврат СокрЛП(ТекстКомментария);
КонецФункции



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Идентификатор личного обсуждения системы взаимодействий.
// 
// Параметры:
//  ИдентификаторПользователя1 - ИдентификаторПользователяСистемыВзаимодействия- Идентификатор пользователя1
//  ИдентификаторПользователя2 - ИдентификаторПользователяСистемыВзаимодействия- Идентификатор пользователя2
// 
// Возвращаемое значение:
//  ИдентификаторОбсужденияСистемыВзаимодействия, Неопределено -
Функция ИдентификаторЛичногоОбсужденияСистемыВзаимодействий(ИдентификаторПользователя1, ИдентификаторПользователя2)
	Если Не ЗначениеЗаполнено(ИдентификаторПользователя1) Или Не ЗначениеЗаполнено(ИдентификаторПользователя2) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Отбор = Новый ОтборОбсужденийСистемыВзаимодействия;
	Отбор.Групповое = Ложь;
	Отбор.КонтекстноеОбсуждение = Ложь;

	Обсуждения = СистемаВзаимодействия.ПолучитьОбсуждения(Отбор);

	Для Каждого ТекОбсуждение Из Обсуждения Цикл
		Если ТекОбсуждение.Участники.Содержит(ИдентификаторПользователя1)
			 И ТекОбсуждение.Участники.Содержит(ИдентификаторПользователя2) Тогда
			Возврат ТекОбсуждение.Идентификатор;
		КонецЕсли;
	КонецЦикла;

	Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
	Обсуждение.Групповое = Ложь;
	Обсуждение.Отображаемое = Истина;
	Обсуждение.Участники.Добавить(ИдентификаторПользователя1);
	Обсуждение.Участники.Добавить(ИдентификаторПользователя2);
	Обсуждение.Записать();
	Возврат Обсуждение.Идентификатор;
КонецФункции

// Идетификатор пользователя системы взаимодейтствия по идентификатору пользователя БД.
// 
// Параметры:
//  ИдентификаторПользователяБД - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  ИдентификаторПользователяСистемыВзаимодействия, Неопределено - Пользователь системы взаимодействия
Функция ИдетификаторПользователяСистемыВзаимодейтствияПоИдентификаторуПользователяБД(ИдентификаторПользователяБД)
	Если Не ЗначениеЗаполнено(ИдентификаторПользователяБД) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПользователиСистемы = СистемаВзаимодействия.ПолучитьПользователей();
	Для Каждого ТекПользовательСистемы Из ПользователиСистемы Цикл
		Если ТекПользовательСистемы.ИдентификаторПользователяИнформационнойБазы = ИдентификаторПользователяБД Тогда
			Возврат ТекПользовательСистемы.Идентификатор;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;	
КонецФункции

// Пользователь системы взаимодействия.
// 
// Параметры:
//  ТекущийПользователь - СправочникСсылка.Пользователи- Текущий пользователь
// 
// Возвращаемое значение:
//  ИдентификаторПользователяСистемыВзаимодействия, Неопределено - Пользователь системы взаимодействия
Функция ИдентификаторПользователяСистемыВзаимодействияПоПользователю(ТекущийПользователь)
	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(ТекущийПользователь) <> Тип("СправочникСсылка.Пользователи") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ИдетификаторПользователяСистемыВзаимодейтствияПоИдентификаторуПользователяБД(ТекущийПользователь.ИдентификаторПользователяИБ);
КонецФункции

// Идентификатор пользователя системы взаимодействия по имени пользователя БД.
// 
// Параметры:
//  ИмяПользователя - Строка - Имя пользователя
// 
// Возвращаемое значение:
//  ИдентификаторПользователяСистемыВзаимодействия, Неопределено - Идентификатор пользователя системы взаимодействия по имени пользователя БД
Функция ИдентификаторПользователяСистемыВзаимодействияПоИмениПользователя(ИмяПользователя)
	Отбор = Новый ОтборПользователейСистемыВзаимодействия();
	Отбор.Имя = ИмяПользователя;
	ПользователиСистемы = СистемаВзаимодействия.ПолучитьПользователей(Отбор);
	Если ПользователиСистемы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПользователиСистемы[0].Идентификатор;
КонецФункции


Функция СтрокаJSONИзОбъекта(Объект)
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Объект);
	Возврат Запись.Закрыть();

КонецФункции
Функция СтрокаJSONВОбъект(СтрокаJSON)
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ОтветJson = ПрочитатьJSON(Чтение);

	Чтение.Закрыть();

	Возврат ОтветJson;
КонецФункции


#КонецОбласти

