Процедура ПриНачалеРаботыСистемы() Экспорт
	ПланГлобальногоПоиска=Новый ПланГлобальногоПоиска;
	
	//Поиск по номеру задачи
	//ЭлементПОиска=Новый ЭлементПланаГлобальногоПоиска("ПоискЗадачиПоНомеру","ГлобальныйПоискКлиент",Ложь,Истина);
	//ПланГлобальногоПоиска.Добавить(ЭлементПОиска);
	
	ЭлементПОиска=Новый ЭлементПланаГлобальногоПоиска("ПоискПроектовПоПодстрокеНаименования","ГлобальныйПоискСервер",Истина,Истина);
	ПланГлобальногоПоиска.Добавить(ЭлементПОиска);
	
	ГлобальныйПоиск.УстановитьПлан(ПланГлобальногоПоиска);
	ГлобальныйПоиск.УстановитьОписание("Если введен номер задачи, откроектся задача. Если ввести имя проекта, найдет проекты с такими наименованиями");
	ГлобальныйПоиск.УстановитьПодсказкуВвода("Номер задачи или часть имени проекта");
	//ГлобальныйПоиск.
КонецПроцедуры

Процедура ПриГлобальномПоиске(СтрокаПоиска,ПланПоиска) Экспорт
	Попытка
		Номер=Число(СтрокаПоиска);
	Исключение
		Номер=Неопределено;
	КонецПопытки;
	            
	Если Номер<>Неопределено Тогда 
		Задача=УправлениеЗадачами.НайтиЗадачуПоНомеру(Номер);
		Если ЗначениеЗаполнено(Задача) Тогда
			ПоказатьЗначение(,Задача);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка)  Экспорт
	Если ЭлементРезультата.ВидПоиска="ПоискПроектовПоПодстрокеНаименования" Тогда
		СтандартнаяОбработка=Ложь;
		
		Оповестить("НайденПроектВГлобальномПоиске",ЭлементРезультата.Значение);
	КонецЕсли;
	
	
КонецПроцедуры




