#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Документы.Задача);
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактировать;
	// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокЗадач.Отбор,"Проект",ВидСравненияКомпоновкиДанных.ВИерархии,Неопределено,,Ложь,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);

	УправлениеЗадачами.УстановитьОтборыПоУмолчаниюВСпискеЗадач(ЭтотОбъект, СписокЗадач);
	
	ОтборСписокСтатусов = ПредопределенноеЗначение("Справочник.СпискиСтатусовЗадач.КВыполнению");
	ИспользоватьОтборСписокСтатусов = Истина;
	ОбновитьОтборПоСпискуСтатусов(СписокЗадач, ОтборСписокСтатусов, ИспользоватьОтборСписокСтатусов);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="НайденПроектВГлобальномПоиске" Тогда
		
		Если Не ЗначениеЗаполнено(Параметр) Тогда
			Возврат;
		КонецЕсли;
		
		Элементы.Проекты.ТекущаяСтрока=Параметр;
		Активизировать();
		
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменилисьТрудозатраты" Тогда
		Элементы.СписокЗадач.Обновить();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьОтборСписокСтатусовПриИзменении(Элемент)
	
	ОбновитьОтборПоСпискуСтатусов(СписокЗадач, ОтборСписокСтатусов, ИспользоватьОтборСписокСтатусов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСписокСтатусовПриИзменении(Элемент)
	
	ИспользоватьОтборСписокСтатусов = ЗначениеЗаполнено(ОтборСписокСтатусов);
	ОбновитьОтборПоСпискуСтатусов(СписокЗадач, ОтборСписокСтатусов, ИспользоватьОтборСписокСтатусов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗадач

&НаКлиенте
Процедура СписокЗадачПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПроект = Элементы.Проекты.ТекущаяСтрока;
	
	Если ЗначениеЗаполнено(ТекущийПроект) Тогда
		
		Отказ = Истина;
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Проект", ТекущийПроект);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.Задача.Форма.ФормаДокументаНовойЗадачи", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.СписокЗадач, СписокЗадач);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

#КонецОбласти

#Область ОбработчикиСобытийЭлементовПанелиОтбора

&НаКлиенте
Процедура ПанельОтбораПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьРабочееПространство(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКонтрагентовПриАктивизацииСтроки(Элемент)
	ВыбранныйКонтрагент = Элементы.ДеревоКонтрагентов.ТекущиеДанные.Контрагент;
	Если Элементы.ДеревоКонтрагентов.ТекущиеДанные.Флаг = Ложь Тогда
		Элементы.ПанельДанныхКонтрагента.Видимость = Ложь;
		Элементы.ПанельЗадачКонтрагента.Видимость = Истина;
	Иначе
		Элементы.ПанельДанныхКонтрагента.Видимость = Истина;
		Элементы.ПанельЗадачКонтрагента.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроектыПриАктивизацииСтроки(Элемент)
	УстановитьФильтрыПоПроекту(Элементы.Проекты.ТекущаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьГруппуФильтров(Команда)
	Элементы.ПанельФильтров.Видимость=Не Элементы.ПанельФильтров.Видимость;
	Если Элементы.ПанельФильтров.Видимость Тогда 
		Элементы.СвернутьГруппуФильтров.Картинка= БиблиотекаКартинок.Влево;
	Иначе
		Элементы.СвернутьГруппуФильтров.Картинка= БиблиотекаКартинок.Вправо;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УправлениеЗадачами.УстановитьУсловноеОформлениеСпискаЗадач(СписокЗадач);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРабочееПространство(ТекущаяСтраница);
	
	Для каждого ТекЭлемент Из Элементы.РабочееПространство.ПодчиненныеЭлементы Цикл
		Если ТекЭлемент.Имя <> СтрЗаменить(ТекущаяСтраница.Имя,"Страница","Панель") Тогда
			ТекЭлемент.Видимость = Ложь;
		Иначе
			ТекЭлемент.Видимость = Истина;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФильтрыПоПроекту(ТекущийПроект)
	
	МассивЭлементовОтбораПоПроекту=ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокЗадач.Отбор,"Проект");
	Если МассивЭлементовОтбораПоПроекту.Количество()=0 Тогда
		Если ЗначениеЗаполнено(ТекущийПроект) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокЗадач.Отбор,"Проект",ВидСравненияКомпоновкиДанных.ВИерархии,ТекущийПроект,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
	Иначе
		МассивЭлементовОтбораПоПроекту[0].Использование=ЗначениеЗаполнено(ТекущийПроект);
		МассивЭлементовОтбораПоПроекту[0].ПравоеЗначение=ТекущийПроект;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтборПоСпискуСтатусов(Список, СписокСтатусов, ИспользоватьОтборПоСпискуСтатусов)
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Статус", 
		УправлениеЗадачами.СтатусыСписка(СписокСтатусов), 
		ВидСравненияКомпоновкиДанных.ВСписке,
		, 
		ИспользоватьОтборПоСпискуСтатусов,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

#КонецОбласти



