////////////////////////////////////////////////////////////////////////////////
// УчетВремениКлиентСервер
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция РазностьДатВЧасах(ДатаНачала, ДатаОкончания) Экспорт
	
	ЧасВСекундах = 3600;
	Продолжительность = Окр((ДатаОкончания - ДатаНачала) / ЧасВСекундах, 2);
	
	Возврат Продолжительность;
	
КонецФункции

Функция ДобавитьЧас(Дата, КоличествоЧасов) Экспорт
	
	ЧасВСекундах = 3600;
	Возврат Дата + КоличествоЧасов * ЧасВСекундах;
	
КонецФункции

Функция ДобавитьДень(Дата, КоличествоДней) Экспорт
	
	ДеньВСекундах = 86400;
	Возврат Дата + КоличествоДней * ДеньВСекундах;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти