////////////////////////////////////////////////////////////////////////////////
// УчетВремениКлиентСервер
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция РазностьДатВЧасах(ДатаНачала, ДатаОкончания) Экспорт

	ЧасВСекундах = 3600;
	Продолжительность = Окр((ДатаОкончания - ДатаНачала) / ЧасВСекундах, 2);

	Возврат Продолжительность;

КонецФункции

Функция ДобавитьЧас(Дата, КоличествоЧасов) Экспорт

	ЧасВСекундах = 3600;
	Возврат Дата + КоличествоЧасов * ЧасВСекундах;

КонецФункции

Функция ДобавитьДень(Дата, КоличествоДней) Экспорт

	ДеньВСекундах = 86400;
	Возврат Дата + КоличествоДней * ДеньВСекундах;

КонецФункции


Функция ПредставлениеДаты(Дата, ТекДата) Экспорт

	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат "-";
	ИначеЕсли НачалоДня(Дата) = НачалоДня(ТекДата) Тогда
		Возврат Формат(Дата, "ДФ=HH:mm");
	Иначе
		Возврат Формат(Дата, "ДФ='dd.MM HH:mm'");
	КонецЕсли;

КонецФункции

Функция ШкалаЗначенийТрудозатрат() Экспорт
	Возврат СтрРазделить("0;0.25;0.5;1;1.5;2;3;4", ";", Ложь);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти