#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Свойство("Партнер") Тогда
		Отказ=Истина;
	КонецЕсли;	
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидКИТелефонКонтактногоЛица",
		Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица);
	Список.Параметры.УстановитьЗначениеПараметра("ВидКИemailКонтактногоЛица",
		Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);

	Список.Параметры.УстановитьЗначениеПараметра("Партнеры", Параметры.Партнер);
КонецПроцедуры


#КонецОбласти
