#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Свойство("Партнер") Тогда
		Отказ=Истина;
	КонецЕсли;	
	
	Партнер = Параметры.Партнер;
	
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		Отказ=Истина;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидКИТелефонКонтактногоЛица",
		Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица);
	Список.Параметры.УстановитьЗначениеПараметра("ВидКИemailКонтактногоЛица",
		Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);

	Список.Параметры.УстановитьЗначениеПараметра("Партнеры", Партнер);
КонецПроцедуры




#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Отказ=Истина;
	
	ФизическиеЛицаКлиент.НачатьСозданиеФизическогоЛицаПривязанногоКПартнеру(Партнер);
КонецПроцедуры
#КонецОбласти