&НаСервере
Процедура РассчитатьСуммуДоговора() 
	//Сумма=Аренда.РассчитатьГодовуюСуммуПоДоговору(КонецДня(Объект.Дата),,Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РассчитатьСуммуДоговора();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаПриИзменении(Элемент)
	РассчитатьСуммуДоговора();
КонецПроцедуры

&НАСервере
Процедура УстановитьДатуОкончанияДоговораРЕализации() 
	Если Объект.ТипДоговора=Перечисления.ТипыДоговоров.Аренда Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаКонца=ДобавитьМесяц(Объект.ДатаНачала,60)-1;
КонецПроцедуры 

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	УстановитьДатуОкончанияДоговораРЕализации();
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	Текст = Элемент.ТекстРедактирования;
	Если ПустаяСтрока(Текст) Тогда
		Объект.Адрес = "";
		Возврат;
	КонецЕсли;
		
	// Формируем внутренние значения полей по тексту и параметрам формирования из
	// реквизита ВидКонтактнойИнформацииАдресаДоставки
	Объект.Адрес = Текст;
КонецПроцедуры


&НаКлиенте
Процедура АдресОчистка(Элемент, СтандартнаяОбработка)
	Объект.Адрес = "";
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ПослеЗаписиДоговораОбновитьСписок", ПараметрыЗаписи, Объект.Ссылка); 
КонецПроцедуры


&НаКлиенте
Процедура ТипДоговораПриИзменении(Элемент)
	РассчитатьСуммуДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуИтого(ДанныеСтроки)
	
	ДанныеСтроки.СуммаВсего = ДанныеСтроки.СуммаОсновнойДолг + ДанныеСтроки.СуммаПроценты;
	
КонецПроцедуры

