
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Договор") Тогда
		Договор=Параметры.Договор;
		Если Договор<>Неопределено и ЗначениеЗаполнено(Договор) Тогда
			
			ЭлементОтбора=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.Использование=Истина;
			ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДоговорКонтрагента");
			ЭлементОтбора.ПравоеЗначение=Договор;
		КонецЕсли;
	КОнецЕсли;
КонецПроцедуры
