
&НаКлиенте
Процедура Очистить(Команда)
	
	ТекстВопроса = "Вы уверены, что хотите полностью очистить регистр логов?";
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьРегистрЛогов();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОчиститьРегистрЛогов()
	
	Набор = РегистрыСведений.RA_ЛогиЗапросов.СоздатьНаборЗаписей();
	Набор.Записать();
	
КонецПроцедуры
